---
kind: enumMember
id: F:Autodesk.Revit.DB.Mechanical.ComponentClassification.Flange
enum: Autodesk.Revit.DB.Mechanical.ComponentClassification
source: html/7abbd56a-3b9a-f51e-861c-5f034fec614e.htm
---
# Autodesk.Revit.DB.Mechanical.ComponentClassification.Flange

Flange component classification